spec/cassettes/spreedly_sandbox/gateway/show.yml

---
http_interactions:
- request:
    method: post
    uri: https://core.spreedly.com/v1/payment_methods.json
    body:
      encoding: UTF-8
      string: '{"payment_method":{"credit_card":{"first_name":"John","last_name":"Doe","number":"4111111111111111","verification_value":"123","month":12,"year":2029},"retained":true}}'
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - application/json
      User-Agent:
      - Ruby
      Host:
      - core.spreedly.com
      Authorization:
      - "<SPREEDLY_BASIC_AUTH>"
      Content-Type:
      - application/json
  response:
    status:
      code: 201
      message: Created
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '1478'
      Content-Type:
      - application/json; charset=utf-8
      Cache-Control:
      - max-age=0, private, must-revalidate
      X-Request-Id:
      - 27263374-c392-4ae2-b5f4-835550faf082
      X-Permitted-Cross-Domain-Policies:
      - none
      Etag:
      - W/"f7780d9431cc2b40ee925a05fb64f762"
      Server:
      - openresty
      X-Content-Type-Options:
      - nosniff
      Referrer-Policy:
      - strict-origin-when-cross-origin
      X-Frame-Options:
      - SAMEORIGIN
      X-Xss-Protection:
      - '0'
      Accept-Ranges:
      - bytes
      Via:
      - 1.1 varnish, 1.1 varnish
      Date:
      - Thu, 25 Jun 2026 09:02:57 GMT
      X-Served-By:
      - cache-iad-kcgs7200163-IAD, cache-iad-kcgs7200163-IAD, cache-bom-vanm7210030-BOM
      X-Cache:
      - MISS, MISS, MISS
      X-Cache-Hits:
      - 0, 0, 0
      X-Timer:
      - S1782378177.965705,VS0,VE361
      Vary:
      - Origin
      Strict-Transport-Security:
      - max-age=31557600
    body:
      encoding: UTF-8
      string: '{"transaction":{"token":"07YAFDTMV481MBSJKD98RV80DS","created_at":"2026-06-25T09:02:57Z","updated_at":"2026-06-25T09:02:57Z","succeeded":true,"transaction_type":"AddPaymentMethod","retained":true,"state":"succeeded","message_key":"messages.transaction_succeeded","message":"Succeeded!","payment_method":{"token":"01KVZ098K88EJBNW15CR430BEJ","created_at":"2026-06-25T09:02:57.128Z","updated_at":"2026-06-25T09:02:57.128Z","email":null,"data":null,"storage_state":"retained","test":true,"metadata":null,"callback_url":null,"last_successfully_used":null,"last_four_digits":"1111","first_six_digits":"411111","card_type":"visa","first_name":"John","last_name":"Doe","month":12,"year":2029,"address1":null,"address2":null,"city":null,"state":null,"zip":null,"country":null,"phone_number":null,"company":null,"full_name":"John
        Doe","eligible_for_card_updater":true,"shipping_address1":null,"shipping_address2":null,"shipping_city":null,"shipping_state":null,"shipping_zip":null,"shipping_country":null,"shipping_phone_number":null,"issuer_identification_number":"41111111","click_to_pay":false,"managed":true,"bin_metadata":{"message":"BIN
        Metadata is available only to Advanced Vault enrolled customers and payment
        methods. Reach out to your account representative for more details."},"subscribed_to_mastercard_abu":false,"payment_method_type":"credit_card","errors":[],"fingerprint":"77ed9d440de08f530960d1b5b03431efafcb","verification_value":"XXX","number":"XXXX-XXXX-XXXX-1111"}}}'
  recorded_at: Thu, 25 Jun 2026 09:02:57 GMT
- request:
    method: post
    uri: https://core.spreedly.com/v1/gateways/test-gateway-token/purchase.json
    body:
      encoding: UTF-8
      string: '{"transaction":{"payment_method_token":"01KVZ098K88EJBNW15CR430BEJ","amount":1000,"currency_code":"USD","order_id":"SPEC-GATEWAY-FETCHES-THE-CURRENT-STATE-OF-A-TRANSACTION"}}'
    headers:
      Content-Type:
      - application/json
      Authorization:
      - "<SPREEDLY_BASIC_AUTH>"
      Accept:
      - application/json
      Connection:
      - close
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Connection:
      - close
      Content-Length:
      - '3012'
      Content-Type:
      - application/json; charset=utf-8
      Cache-Control:
      - max-age=0, private, must-revalidate
      X-Request-Id:
      - 6a1f5a59-0acf-4c99-9421-03a7debc1e00
      X-Permitted-Cross-Domain-Policies:
      - none
      Etag:
      - W/"9a67378858f1b9a614cc82fe03b8ef4c"
      Server:
      - openresty
      X-Content-Type-Options:
      - nosniff
      Referrer-Policy:
      - strict-origin-when-cross-origin
      X-Frame-Options:
      - SAMEORIGIN
      X-Xss-Protection:
      - '0'
      Accept-Ranges:
      - bytes
      Via:
      - 1.1 varnish, 1.1 varnish
      Date:
      - Thu, 25 Jun 2026 09:02:59 GMT
      X-Served-By:
      - cache-iad-kjyo7100038-IAD, cache-iad-kjyo7100038-IAD, cache-bom-vanm7210042-BOM
      X-Cache:
      - MISS, MISS, MISS
      X-Cache-Hits:
      - 0, 0, 0
      X-Timer:
      - S1782378178.511056,VS0,VE1672
      Strict-Transport-Security:
      - max-age=31557600
    body:
      encoding: UTF-8
      string: '{"transaction":{"on_test_gateway":true,"created_at":"2026-06-25T09:02:57Z","updated_at":"2026-06-25T09:02:58Z","succeeded":true,"state":"succeeded","token":"01KVZ0994CNRCXC52HD4QDGB9B","transaction_type":"Purchase","order_id":"SPEC-GATEWAY-FETCHES-THE-CURRENT-STATE-OF-A-TRANSACTION","ip":null,"description":null,"email":null,"merchant_name_descriptor":null,"merchant_location_descriptor":null,"merchant_profile_key":null,"gateway_specific_fields":{},"gateway_specific_response_fields":{"braintree":{}},"gateway_transaction_id":"8bhvygjy","sub_merchant_key":null,"gateway_latency_ms":1040,"warning":null,"application_id":"Spreedly_BT","risk_data":{},"merchant_metadata":{},"customer_data":{},"order_data":{},"workflow_key":null,"protection_parameters":{},"amount":1000,"local_amount":null,"currency_code":"USD","retain_on_success":false,"payment_method_added":false,"smart_routed":false,"stored_credential_initiator":null,"stored_credential_reason_type":null,"stored_credential_alternate_gateway":null,"stored_credential_final_payment":false,"message_key":"messages.transaction_succeeded","message":"Succeeded!","gateway_token":"test-gateway-token","gateway_type":"braintree","response":{"success":true,"message":"1000
        Approved","avs_code":"I","avs_message":"Address not verified.","cvv_code":"M","cvv_message":"","pending":false,"result_unknown":false,"error_code":null,"error_detail":null,"cancelled":false,"fraud_review":null,"created_at":"2026-06-25T09:02:58Z","updated_at":"2026-06-25T09:02:58Z","status":null,"network_transaction_id":""},"shipping_address":{"name":"John
        Doe","address1":null,"address2":null,"city":null,"state":null,"zip":null,"country":null,"phone_number":null,"email":null,"metadata":null},"api_urls":[{"referencing_transaction":[]},{"failover_transaction":[]}],"attempt_3dsecure":false,"payment_method":{"token":"01KVZ098K88EJBNW15CR430BEJ","created_at":"2026-06-25T09:02:57.128Z","updated_at":"2026-06-25T09:02:57.128Z","email":null,"data":null,"storage_state":"retained","test":true,"metadata":null,"callback_url":null,"last_successfully_used":null,"last_four_digits":"1111","first_six_digits":"411111","card_type":"visa","first_name":"John","last_name":"Doe","month":12,"year":2029,"address1":null,"address2":null,"city":null,"state":null,"zip":null,"country":null,"phone_number":null,"company":null,"full_name":"John
        Doe","eligible_for_card_updater":true,"shipping_address1":null,"shipping_address2":null,"shipping_city":null,"shipping_state":null,"shipping_zip":null,"shipping_country":null,"shipping_phone_number":null,"issuer_identification_number":"41111111","click_to_pay":false,"managed":true,"bin_metadata":{"message":"BIN
        Metadata is available only to Advanced Vault enrolled customers and payment
        methods. Reach out to your account representative for more details."},"subscribed_to_mastercard_abu":false,"payment_method_type":"credit_card","errors":[],"fingerprint":"77ed9d440de08f530960d1b5b03431efafcb","verification_value":"XXX","number":"XXXX-XXXX-XXXX-1111"}}}'
  recorded_at: Thu, 25 Jun 2026 09:02:59 GMT
- request:
    method: get
    uri: https://core.spreedly.com/v1/transactions/01KVZ0994CNRCXC52HD4QDGB9B.json
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Authorization:
      - "<SPREEDLY_BASIC_AUTH>"
      Content-Type:
      - application/json
      Accept:
      - application/json
      Connection:
      - close
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Connection:
      - close
      Content-Length:
      - '3012'
      X-Request-Id:
      - e478ee59-6ef3-4919-8bad-8fc6a09b89a1
      Referrer-Policy:
      - strict-origin-when-cross-origin
      Server:
      - openresty
      Etag:
      - W/"9a67378858f1b9a614cc82fe03b8ef4c"
      X-Xss-Protection:
      - '0'
      Content-Type:
      - application/json; charset=utf-8
      X-Permitted-Cross-Domain-Policies:
      - none
      X-Frame-Options:
      - SAMEORIGIN
      X-Content-Type-Options:
      - nosniff
      Cache-Control:
      - max-age=0, private, must-revalidate
      Accept-Ranges:
      - bytes
      Via:
      - 1.1 varnish, 1.1 varnish
      Date:
      - Thu, 25 Jun 2026 09:02:59 GMT
      X-Served-By:
      - cache-iad-kiad7000127-IAD, cache-iad-kiad7000081-IAD, cache-bom-vanm7210046-BOM
      X-Cache:
      - MISS, MISS, MISS
      X-Cache-Hits:
      - 0, 0, 0
      X-Timer:
      - S1782378179.298883,VS0,VE388
      Strict-Transport-Security:
      - max-age=31557600
    body:
      encoding: UTF-8
      string: '{"transaction":{"on_test_gateway":true,"created_at":"2026-06-25T09:02:57Z","updated_at":"2026-06-25T09:02:58Z","succeeded":true,"state":"succeeded","token":"01KVZ0994CNRCXC52HD4QDGB9B","transaction_type":"Purchase","order_id":"SPEC-GATEWAY-FETCHES-THE-CURRENT-STATE-OF-A-TRANSACTION","ip":null,"description":null,"email":null,"merchant_name_descriptor":null,"merchant_location_descriptor":null,"merchant_profile_key":null,"gateway_specific_fields":{},"gateway_specific_response_fields":{"braintree":{}},"gateway_transaction_id":"8bhvygjy","sub_merchant_key":null,"gateway_latency_ms":1040,"warning":null,"application_id":"Spreedly_BT","risk_data":{},"merchant_metadata":{},"customer_data":{},"order_data":{},"workflow_key":null,"protection_parameters":{},"amount":1000,"local_amount":null,"currency_code":"USD","retain_on_success":false,"payment_method_added":false,"smart_routed":false,"stored_credential_initiator":null,"stored_credential_reason_type":null,"stored_credential_alternate_gateway":null,"stored_credential_final_payment":false,"message_key":"messages.transaction_succeeded","message":"Succeeded!","gateway_token":"test-gateway-token","gateway_type":"braintree","response":{"success":true,"message":"1000
        Approved","avs_code":"I","avs_message":"Address not verified.","cvv_code":"M","cvv_message":"","pending":false,"result_unknown":false,"error_code":null,"error_detail":null,"cancelled":false,"fraud_review":null,"created_at":"2026-06-25T09:02:58Z","updated_at":"2026-06-25T09:02:58Z","status":null,"network_transaction_id":""},"shipping_address":{"name":"John
        Doe","address1":null,"address2":null,"city":null,"state":null,"zip":null,"country":null,"phone_number":null,"email":null,"metadata":null},"api_urls":[{"referencing_transaction":[]},{"failover_transaction":[]}],"attempt_3dsecure":false,"payment_method":{"token":"01KVZ098K88EJBNW15CR430BEJ","created_at":"2026-06-25T09:02:57.128Z","updated_at":"2026-06-25T09:02:57.128Z","email":null,"data":null,"storage_state":"retained","test":true,"metadata":null,"callback_url":null,"last_successfully_used":null,"last_four_digits":"1111","first_six_digits":"411111","card_type":"visa","first_name":"John","last_name":"Doe","month":12,"year":2029,"address1":null,"address2":null,"city":null,"state":null,"zip":null,"country":null,"phone_number":null,"company":null,"full_name":"John
        Doe","eligible_for_card_updater":true,"shipping_address1":null,"shipping_address2":null,"shipping_city":null,"shipping_state":null,"shipping_zip":null,"shipping_country":null,"shipping_phone_number":null,"issuer_identification_number":"41111111","click_to_pay":false,"managed":true,"bin_metadata":{"message":"BIN
        Metadata is available only to Advanced Vault enrolled customers and payment
        methods. Reach out to your account representative for more details."},"subscribed_to_mastercard_abu":false,"payment_method_type":"credit_card","errors":[],"fingerprint":"77ed9d440de08f530960d1b5b03431efafcb","verification_value":"XXX","number":"XXXX-XXXX-XXXX-1111"}}}'
  recorded_at: Thu, 25 Jun 2026 09:02:59 GMT
recorded_with: VCR 6.4.0
